/**
 *  @file    hw_hwa_commonreg.h
 *
 *  @brief
 *    This file gives register definitions of DSS_HW_ACC module.
 *
 *  This file is auto-generated.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_PARITY_ERR_STATUS_RAW_WINDOW_RAM_BIT_END     1U
/** Definition for field HWA_SAFETY_PARITY_ERR_STATUS_RAW_IPING_RAM in Register HWA_SAFETY_ERR_STATUS_RAW**/
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_PARITY_ERR_STATUS_RAW_IPING_RAM_BIT_START   2U
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_PARITY_ERR_STATUS_RAW_IPING_RAM_BIT_END     2U
/** Definition for field HWA_SAFETY_PARITY_ERR_STATUS_RAW_IPONG_RAM in Register HWA_SAFETY_ERR_STATUS_RAW**/
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_PARITY_ERR_STATUS_RAW_IPONG_RAM_BIT_START   3U
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_PARITY_ERR_STATUS_RAW_IPONG_RAM_BIT_END     3U
/** Definition for field HWA_SAFETY_PARITY_ERR_STATUS_RAW_OPING_RAM in Register HWA_SAFETY_ERR_STATUS_RAW**/
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_PARITY_ERR_STATUS_RAW_OPING_RAM_BIT_START   4U
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_PARITY_ERR_STATUS_RAW_OPING_RAM_BIT_END     4U
/** Definition for field HWA_SAFETY_PARITY_ERR_STATUS_RAW_OPONG_RAM in Register HWA_SAFETY_ERR_STATUS_RAW**/
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_PARITY_ERR_STATUS_RAW_OPONG_RAM_BIT_START   5U
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_PARITY_ERR_STATUS_RAW_OPONG_RAM_BIT_END     5U
/** Definition for field HWA_SAFETY_ACCESS_ERR_STATUS_RAW_IPING_RAM in Register HWA_SAFETY_ERR_STATUS_RAW**/
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_ACCESS_ERR_STATUS_RAW_IPING_RAM_BIT_START   6U
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_ACCESS_ERR_STATUS_RAW_IPING_RAM_BIT_END     6U
/** Definition for field HWA_SAFETY_ACCESS_ERR_STATUS_RAW_IPONG_RAM in Register HWA_SAFETY_ERR_STATUS_RAW**/
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_ACCESS_ERR_STATUS_RAW_IPONG_RAM_BIT_START   7U
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_ACCESS_ERR_STATUS_RAW_IPONG_RAM_BIT_END     7U
/** Definition for field HWA_SAFETY_ACCESS_ERR_STATUS_RAW_OPING_RAM in Register HWA_SAFETY_ERR_STATUS_RAW**/
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_ACCESS_ERR_STATUS_RAW_OPING_RAM_BIT_START   8U
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_ACCESS_ERR_STATUS_RAW_OPING_RAM_BIT_END     8U
/** Definition for field HWA_SAFETY_ACCESS_ERR_STATUS_RAW_OPONG_RAM in Register HWA_SAFETY_ERR_STATUS_RAW**/
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_ACCESS_ERR_STATUS_RAW_OPONG_RAM_BIT_START   9U
#define HWA_SAFETY_ERR_STATUS_RAW_HWA_SAFETY_ACCESS_ERR_STATUS_RAW_OPONG_RAM_BIT_END     9U
/** Definition for field NU1 in Register HWA_SAFETY_ERR_STATUS_RAW**/
#define HWA_SAFETY_ERR_STATUS_RAW_NU1_BIT_START   10U
#define HWA_SAFETY_ERR_STATUS_RAW_NU1_BIT_END     31U

/** @struct hwaMaxStats
*   @brief  Hardware accelerator stats Register Definition
*
*   This structure is used to access the Hardware accelerator stats registers within the common space.
*/
/** @typedef hwaMaxStats_t
*   @brief  Hardware accelerator stats Register Definition
*
*   This structure is used to access the Hardware accelerator stats registers within the common space.
*/
typedef volatile struct hwaMaxStats
{
    uint32_t    MAXnVALUE       ;        /* AddrOffset = 0x000 */
    uint32_t    MAXnINDEX       ;        /* AddrOffset = 0x004 */
    uint32_t    ISUMnLSB        ;        /* AddrOffset = 0x008 */
    uint32_t    ISUMnMSB        ;        /* AddrOffset = 0x00C */
    uint32_t    QSUMnLSB        ;        /* AddrOffset = 0x010 */
    uint32_t    QSUMnMSB        ;        /* AddrOffset = 0x014 */
} hwaMaxStats_t;

/** @struct hwaAccVal
*   @brief  HWA accumulator register data structure
*
*/
typedef volatile struct hwaAccVal_t
{
    uint32_t    accValLSB;        /* AddrOffset = 0x000 */
    uint32_t    accValMSB;        /* AddrOffset = 0x004 */
} hwaAccVal;

/**
 * @struct DSSHWACCRegs_t
 * @brief
 *   Module DSS_HW_ACC Register Definition
 * @details
 *   This structure is used to access the DSS_HW_ACC module registers.
 */
/**
 * @typedef DSSHWACCRegs
 * @brief
 *   Module DSS_HW_ACC Register Frame type Definition
 * @details
 *   This type is used to access the DSS_HW_ACC module registers.
 */
typedef volatile struct DSSHWACCRegs_t
{
    uint32_t  HWACCREG1   ;  /** Offset = 0x0 */
    uint32_t  HWACCREG2   ;  /** Offset = 0x4 */
    uint32_t  HWACCREG3   ;  /** Offset = 0x8 */
    uint32_t  HWACCREG4   ;  /** Offset = 0xc */
    uint32_t  HWACCREG5   ;  /** Offset = 0X10 */
    uint32_t  HWACCREG6   ;  /** Offset = 0x14 */
    uint32_t  HWACCREG7   ;  /** Offset = 0x18 */
    uint32_t  HWACCREG8   ;  /** Offset = 0x1C */
    uint32_t  HWACCREG11   ;  /** Offset = 0x20  */
    uint32_t  HWACCREG12   ;  /** Offset = 0x24  */
    uint32_t  HWACCREG13   ;  /** Offset = 0x28 */
    uint32_t  HWACCREG14   ;  /** Offset = 0x2C */
    uint32_t  HWACCREG15   ;  /** Offset = 0x30  */
    uint32_t  CFAR_DET_THR ;  /** Offset = 0x34  */

#if 0
    uint32_t  MAX1VALUE   ;  /** Offset = 0x38  */
    uint32_t  MAX1INDEX   ;  /** Offset = 0x3C  */
    uint32_t  ISUM1LSB   ;  /** Offset = 0x40  */
    uint32_t  ISUM1MSB   ;  /** Offset = 0x44 */
    uint32_t  QSUM1LSB   ;  /** Offset = 0x48 */
    uint32_t  QSUM1MSB   ;  /** Offset = 0x4C  */
    uint32_t  MAX2VALUE   ;  /** Offset = 0x50  */
    uint32_t  MAX2INDEX   ;  /** Offset = 0x54  */
    uint32_t  ISUM2LSB   ;  /** Offset = 0x58  */
    uint32_t  ISUM2MSB   ;  /** Offset = 0x5C  */
    uint32_t  QSUM2LSB   ;  /** Offset = 0x60  */
    uint32_t  QSUM2MSB   ;  /** Offset = 0x64  */
    uint32_t  MAX3VALUE   ;  /** Offset = 0x68  */
    uint32_t  MAX3INDEX   ;  /** Offset = 0x6C  */
    uint32_t  ISUM3LSB   ;  /** Offset = 0x70  */
    uint32_t  ISUM3MSB   ;  /** Offset = 0x74  */
    uint32_t  QSUM3LSB   ;  /** Offset = 0x78  */
    uint32_t  QSUM3MSB   ;  /** Offset = 0x7C */
    uint32_t  MAX4VALUE   ;  /** Offset = 0x80 */
    uint32_t  MAX4INDEX   ;  /** Offset = 0x84 */
    uint32_t  ISUM4LSB   ;  /** Offset = 0x88  */
    uint32_t  ISUM4MSB   ;  /** Offset = 0x8C */
    uint32_t  QSUM4LSB   ;  /** Offset = 0x90  */
    uint32_t  QSUM4MSB   ;  /** Offset = 0x94 */
#else
    hwaMaxStats_t HWACCSTATSREG[4]; /** Offset = 0x38 - 0x94 */
#endif

    uint32_t  Reserved2   ;  /** Offset = 0x98 */
    uint32_t  RDSTATUS   ;  /** Offset = 0x9C */

#if 0
    uint32_t  SIGDMACH1DONE   ;  /** Offset = 0xA0 */
    uint32_t  SIGDMACH2DONE   ;  /** Offset = 0xA4 */
    uint32_t  SIGDMACH3DONE   ;  /** Offset = 0xA8 */
    uint32_t  SIGDMACH4DONE   ;  /** Offset = 0xAC */
    uint32_t  SIGDMACH5DONE   ;  /** Offset = 0xB0 */
    uint32_t  SIGDMACH6DONE   ;  /** Offset = 0xB4 */
    uint32_t  SIGDMACH7DONE   ;  /** Offset = 0xB8 */
    uint32_t  SIGDMACH8DONE   ;  /** Offset = 0xBC */
    uint32_t  SIGDMACH9DONE   ;  /** Offset = 0xC0 */
    uint32_t  SIGDMACH10DONE   ;  /** Offset = 0xC4 */
    uint32_t  SIGDMACH11DONE   ;  /** Offset = 0xC8 */
    uint32_t  SIGDMACH12DONE   ;  /** Offset = 0xCC */
    uint32_t  SIGDMACH13DONE   ;  /** Offset = 0xD0 */
    uint32_t  SIGDMACH14DONE   ;  /** Offset = 0xD4 */
    uint32_t  SIGDMACH15DONE   ;  /** Offset = 0xD8 */
    uint32_t  SIGDMACH16DONE   ;  /** Offset = 0xDC */
#else
    uint32_t    SIGDMACHxDONE[16];  /** Offset = 0xA0 - 0xDC */
#endif    

    uint32_t  Reserved3   ;  /** Offset = 0xE0 */
    uint32_t  FFTCLIP   ;  /** Offset = 0xE4 */
    uint32_t  FFTPEAKCNT   ;  /** Offset = 0xE8 */
    uint32_t  Reserved4[3]   ;  /** Offset = 0xEC - 0xF4 */
    uint32_t  CMP_EGE_K0123   ;  /** Offset = 0xF8 */
    uint32_t  CMP_EGE_K4567   ;  /** Offset = 0xFC */
    uint32_t  HWA_SAFETY_ENABLE   ;  /** Offset = 0x100 */
    uint32_t  MEMINIT   ;  /** Offset = 0x104 */
    uint32_t  MEMINITDONE   ;  /** Offset = 0x108 */
    uint32_t  HWA_SAFETY_WIN_RAM_ERR_LOC   ;  /** Offset = 0x10C */
    uint32_t  HWA_SAFETY_PARAM_RAM_ERR_LOC   ;  /** Offset = 0x110 */
    uint32_t  HWA_SAFETY_IPING_ERR_LOC   ;  /** Offset = 0x114 */
    uint32_t  HWA_SAFETY_IPONG_ERR_LOC   ;  /** Offset = 0x118 */
    uint32_t  HWA_SAFETY_OPING_ERR_LOC   ;  /** Offset = 0x11C */
    uint32_t  HWA_SAFETY_OPONG_ERR_LOC   ;  /** Offset = 0x120 */
    uint32_t  Reserved5[2]   ;  /** Offset = 0x124 - 0x128 */
    uint32_t  HWACCREG16   ;  /** Offset = 0x12C */
    uint32_t  DCEST_I_SW[6]  ;  /** Offset = 0x130 - 0x144 */
    uint32_t  DCEST_I_VAL[6] ;  /** Offset = 0x148 - 0x15C */
    hwaAccVal DC_ACC_I_VAL[6];  /* offset = 0x0160 - 0x018C */
    uint32_t  DCEST_Q_SW[6]  ;  /** Offset = 0x190 - 0x1A4 */
    uint32_t  DCEST_Q_VAL[6] ;  /** Offset = 0x1A8 - 0x1BC */
    hwaAccVal DC_ACC_Q_VAL[6];  /* offset = 0x01C0 - 0x01EC */
    uint32_t  DCACC_CLIP[6]  ;  /** Offset = 0x1F0 - 0x204 */
    uint32_t  DCEST_CLIP[6]  ;  /** Offset = 0x208 - 0x21C*/
    uint32_t  DCSUB_CLIP[6]  ;  /** Offset = 0x220 - 0x234*/
    uint32_t  DCEST_SHIFT   ;  /** Offset = 0x238 */
    uint32_t  DCEST_SCALE   ;  /** Offset = 0x23C */
    uint32_t  INTF_MAG_SCALE   ;  /** Offset = 0x240 */
    uint32_t  INTF_MAG_SHIFT   ;  /** Offset = 0x244 */
    uint32_t  INTF_MAGDIFF_SCALE   ;  /** Offset = 0x248 */
    uint32_t  INTF_MAGDIFF_SHIFT   ;  /** Offset = 0x24C */
    uint32_t  INTF_FRAME_ZEROCOUNT   ;  /** Offset = 0x250 */
    uint32_t  INTF_CHIRP_ZEROCOUNT   ;  /** Offset = 0x254 */
    uint32_t  INTF_MAGTHRESH1_SW   ;  /** Offset = 0x258 */
    uint32_t  INTF_MAGTHRESH2_SW   ;  /** Offset = 0x25C */
    uint32_t  INTF_MAGTHRESH3_SW   ;  /** Offset = 0x260 */
    uint32_t  INTF_MAGTHRESH4_SW   ;  /** Offset = 0x264 */
    uint32_t  INTF_MAGTHRESH5_SW   ;  /** Offset = 0x268 */
    uint32_t  INTF_MAGTHRESH6_SW   ;  /** Offset = 0x26C */
    uint32_t  INTF_MAGDIFFTHRESH1_SW   ;  /** Offset = 0x270 */
    uint32_t  INTF_MAGDIFFTHRESH2_SW   ;  /** Offset = 0x274 */
    uint32_t  INTF_MAGDIFFTHRESH3_SW   ;  /** Offset = 0x278 */
    uint32_t  INTF_MAGDIFFTHRESH4_SW   ;  /** Offset = 0x27C */
    uint32_t  INTF_MAGDIFFTHRESH5_SW   ;  /** Offset = 0x280 */
    uint32_t  INTF_MAGDIFFTHRESH6_SW   ;  /** Offset = 0x284 */
    uint32_t  INTF_MAGACC1_LSB   ;  /** Offset = 0x288 */
    uint32_t  INTF_MAGACC1_MSB   ;  /** Offset = 0x28C */
    uint32_t  INTF_MAGACC2_LSB   ;  /** Offset = 0x290 */
    uint32_t  INTF_MAGACC2_MSB   ;  /** Offset = 0x294 */
    uint32_t  INTF_MAGACC3_LSB   ;  /** Offset = 0x298 */
    uint32_t  INTF_MAGACC3_MSB   ;  /** Offset = 0x29C */
    uint32_t  INTF_MAGACC4_LSB   ;  /** Offset = 0x2A0 */
    uint32_t  INTF_MAGACC4_MSB   ;  /** Offset = 0x2A4 */
    uint32_t  INTF_MAGACC5_LSB   ;  /** Offset = 0x2A8 */
    uint32_t  INTF_MAGACC5_MSB   ;  /** Offset = 0x2AC */
    uint32_t  INTF_MAGACC6_LSB   ;  /** Offset = 0x2B0 */
    uint32_t  INTF_MAGACC6_MSB   ;  /** Offset = 0x2B4 */
    uint32_t  INTF_MAGDIFFACC1_LSB   ;  /** Offset = 0x2B8 */
    uint32_t  INTF_MAGDIFFACC1_MSB   ;  /** Offset = 0x2BC */
    uint32_t  INTF_MAGDIFFACC2_LSB   ;  /** Offset = 0x2C0 */
    uint32_t  INTF_MAGDIFFACC2_MSB   ;  /** Offset = 0x2C4 */
    uint32_t  INTF_MAGDIFFACC3_LSB   ;  /** Offset = 0x2C8 */
    uint32_t  INTF_MAGDIFFACC3_MSB   ;  /** Offset = 0x2CC */
    uint32_t  INTF_MAGDIFFACC4_LSB   ;  /** Offset = 0x2D0 */
    uint32_t  INTF_MAGDIFFACC4_MSB   ;  /** Offset = 0x2D4 */
    uint32_t  INTF_MAGDIFFACC5_LSB   ;  /** Offset = 0x2D8 */
    uint32_t  INTF_MAGDIFFACC5_MSB   ;  /** Offset = 0x2DC */
    uint32_t  INTF_MAGDIFFACC6_LSB   ;  /** Offset = 0x2E0 */
    uint32_t  INTF_MAGDIFFACC6_MSB   ;  /** Offset = 0x2E4 */
    uint32_t  INTF_MAGACC1_CLIP   ;  /** Offset = 0x2E8 */
    uint32_t  INTF_MAGACC2_CLIP   ;  /** Offset = 0x2EC */
    uint32_t  INTF_MAGACC3_CLIP   ;  /** Offset = 0x2F0 */
    uint32_t  INTF_MAGACC4_CLIP   ;  /** Offset = 0x2F4 */
    uint32_t  INTF_MAGACC5_CLIP   ;  /** Offset = 0x2F8 */
    uint32_t  INTF_MAGACC6_CLIP   ;  /** Offset = 0x2FC */
    uint32_t  INTF_MAGDIFFACC1_CLIP   ;  /** Offset = 0x300 */
    uint32_t  INTF_MAGDIFFACC2_CLIP   ;  /** Offset = 0x304 */
    uint32_t  INTF_MAGDIFFACC3_CLIP   ;  /** Offset = 0x308 */
    uint32_t  INTF_MAGDIFFACC4_CLIP   ;  /** Offset = 0x30C */
    uint32_t  INTF_MAGDIFFACC5_CLIP   ;  /** Offset = 0x310 */
    uint32_t  INTF_MAGDIFFACC6_CLIP   ;  /** Offset = 0x314 */
    uint32_t  INTF_MAGTHRESH1   ;  /** Offset = 0x318 */
    uint32_t  INTF_MAGTHRESH2   ;  /** Offset = 0x31C */
    uint32_t  INTF_MAGTHRESH3   ;  /** Offset = 0x320 */
    uint32_t  INTF_MAGTHRESH4   ;  /** Offset = 0x324 */
    uint32_t  INTF_MAGTHRESH5   ;  /** Offset = 0x328 */
    uint32_t  INTF_MAGTHRESH6   ;  /** Offset = 0x32C */
    uint32_t  INTF_MAGDIFFTHRESH1   ;  /** Offset = 0x330 */
    uint32_t  INTF_MAGDIFFTHRESH2   ;  /** Offset = 0x334 */
    uint32_t  INTF_MAGDIFFTHRESH3   ;  /** Offset = 0x338 */
    uint32_t  INTF_MAGDIFFTHRESH4   ;  /** Offset = 0x33C */
    uint32_t  INTF_MAGDIFFTHRESH5   ;  /** Offset = 0x340 */
    uint32_t  INTF_MAGDIFFTHRESH6   ;  /** Offset = 0x344 */
    uint32_t  INTF_SUMMAGTHRESH   ;  /** Offset = 0x348 */
    uint32_t  INTF_SUMMAGDIFFTHRESH   ;  /** Offset = 0x34C */
    uint32_t  INTF_SUMMAGTHRESH_CLIP   ;  /** Offset = 0x350 */
    uint32_t  INTF_SUMMAGDIFFTHRESH_CLIP   ;  /** Offset = 0x354 */
    uint32_t  CMULTSCALE1I   ;  /** Offset = 0x358 */
    uint32_t  CMULTSCALE2I   ;  /** Offset = 0x35C */
    uint32_t  CMULTSCALE3I   ;  /** Offset = 0x360 */
    uint32_t  CMULTSCALE4I   ;  /** Offset = 0x364 */
    uint32_t  CMULTSCALE5I   ;  /** Offset = 0x368 */
    uint32_t  CMULTSCALE6I   ;  /** Offset = 0x36C */
    uint32_t  CMULTSCALE1Q   ;  /** Offset = 0x370 */
    uint32_t  CMULTSCALE2Q   ;  /** Offset = 0x374 */
    uint32_t  CMULTSCALE3Q   ;  /** Offset = 0x378 */
    uint32_t  CMULTSCALE4Q   ;  /** Offset = 0x37C */
    uint32_t  CMULTSCALE5Q   ;  /** Offset = 0x380 */
    uint32_t  CMULTSCALE6Q   ;  /** Offset = 0x384 */
    uint32_t  CLR_MISC_CLIP   ;  /** Offset = 0x388 */
    uint32_t  Reserved6   ;  /** Offset = 0x38C */
    uint32_t  INTF_STATS_RESET_SW   ;  /** Offset = 0x390 */
    uint32_t  DCEST_RESET_SW   ;  /** Offset = 0x394 */
    uint32_t  IP_OP_FORMATTER_CLIP_STATUS   ;  /** Offset = 0x398 */
    uint32_t  INTF_MAGTHRESH1_CLIP   ;  /** Offset = 0x39C */
    uint32_t  INTF_MAGTHRESH2_CLIP   ;  /** Offset = 0x3A0 */
    uint32_t  INTF_MAGTHRESH3_CLIP   ;  /** Offset = 0x3A4 */
    uint32_t  INTF_MAGTHRESH4_CLIP   ;  /** Offset = 0x3A8 */
    uint32_t  INTF_MAGTHRESH5_CLIP   ;  /** Offset = 0x3AC */
    uint32_t  INTF_MAGTHRESH6_CLIP   ;  /** Offset = 0x3B0 */
    uint32_t  INTF_MAGDIFFTHRESH1_CLIP   ;  /** Offset = 0x3B4 */
    uint32_t  INTF_MAGDIFFTHRESH2_CLIP   ;  /** Offset = 0x3B8 */
    uint32_t  INTF_MAGDIFFTHRESH3_CLIP   ;  /** Offset = 0x3BC */
    uint32_t  INTF_MAGDIFFTHRESH4_CLIP   ;  /** Offset = 0x3C0 */
    uint32_t  INTF_MAGDIFFTHRESH5_CLIP   ;  /** Offset = 0x3C4 */
    uint32_t  INTF_MAGDIFFTHRESH6_CLIP   ;  /** Offset = 0x3C8 */
    uint32_t  HWA_SAFETY_ERR_MASK   ;  /** Offset = 0x3CC */
    uint32_t  HWA_SAFETY_ERR_STATUS   ;  /** Offset = 0x3D0 */
    uint32_t  HWA_SAFETY_ERR_STATUS_RAW   ;  /** Offset = 0x3D4 */
} DSSHWACCRegs;

#ifdef __cplusplus
}
#endif

#endif /* HW_HWA_COMMONREG_H_ */
